uploads/xml/Travelport-Request-659553e151796-9729.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="ec46a4684710d9a490cf8ecb4d793ebe">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="TIP"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="ZRH"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-01-04"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="ZRH"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="TIP"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-01-05"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
